app/controllers/movies_controller.rb

  def index

    if !params.has_key?(:order)
      params[:order] = session[:order]
    else
      session[:order] = params[:order]
    end

    if !params.has_key?(:ratings)
      params[:ratings] = session[:ratings]
    else
      session[:ratings] = params[:ratings]
    end



    @all_ratings = Movie.ratings
    @order = params[:order]
    @ratings = params[:ratings] ? params[:ratings].values : @all_ratings
    if Movie.column_names.include? @order
---
SELECT "movies".* FROM "movies" WHERE (rating in (NULL)) ORDER BY release_date